/*
Напишите функцию double dist(x1, y1, x2, y2), которая прини-
мает вещественные декартовы координаты двух точек на плоскости
и возвращает расстояние между ними. Напишите с ее помощью про-
грамму, которая вводит вещественные координаты 
трех точек на плоскости и выводит длину самой длинной стороны тре-
угольника с вершинами в этих точках, или –1, если такого треугольни-
ка не существует.

Пример ввода: 0 0 6 0 3 2, правильный вывод 6.
*/

#include <iostream>

using namespace std;

double dist(/*...*/){
	// ...
	return 0;
}

int main(){
	double x1,y1, x2, y2, x3, y3;
	cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;

	// ...
	return 0;
}